zephyrproject-rtos/zephyr/ext/hal/nxp/mcux/devices/MKE18F16/MKE18F16.xml
      </registers>
    </peripheral>
    <peripheral>
      <name>PDB0</name>
      <description>Programmable Delay Block</description>
      <groupName>PDB</groupName>
      <prependToName>PDB0_</prependToName>
      <headerStructName>PDB</headerStructName>
      <baseAddress>0x40036000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x198</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>PDB0</name>
        <value>52</value>
      </interrupt>
      <registers>
        <register>
          <name>SC</name>
          <description>Status and Control register</description>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LDOK</name>
              <description>Load OK</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CONT</name>
              <description>Continuous Mode Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CONT_0</name>
                  <description>PDB operation in One-Shot mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CONT_1</name>
                  <description>PDB operation in Continuous mode</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MULT</name>
              <description>Multiplication Factor Select for Prescaler</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MULT_0</name>
                  <description>Multiplication factor is 1.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MULT_1</name>
                  <description>Multiplication factor is 10.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MULT_2</name>
                  <description>Multiplication factor is 20.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MULT_3</name>
                  <description>Multiplication factor is 40.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PDBIE</name>
              <description>PDB Interrupt Enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PDBIE_0</name>
                  <description>PDB interrupt disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDBIE_1</name>
                  <description>PDB interrupt enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PDBIF</name>
              <description>PDB Interrupt Flag</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PDBEN</name>
              <description>PDB Enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PDBEN_0</name>
                  <description>PDB disabled. Counter is off.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDBEN_1</name>
                  <description>PDB enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRGSEL</name>
              <description>Trigger Input Source Select</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TRGSEL_0</name>
                  <description>Trigger-In 0 is selected.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRGSEL_1</name>
                  <description>Trigger-In 1 is selected.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRGSEL_2</name>
                  <description>Trigger-In 2 is selected.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRGSEL_3</name>
                  <description>Trigger-In 3 is selected.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRGSEL_4</name>
                  <description>Trigger-In 4 is selected.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRGSEL_5</name>
                  <description>Trigger-In 5 is selected.</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRGSEL_6</name>
                  <description>Trigger-In 6 is selected.</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRGSEL_7</name>
                  <description>Trigger-In 7 is selected.</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRGSEL_8</name>
                  <description>Trigger-In 8 is selected.</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRGSEL_9</name>
                  <description>Trigger-In 9 is selected.</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRGSEL_10</name>
                  <description>Trigger-In 10 is selected.</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRGSEL_11</name>
                  <description>Trigger-In 11 is selected.</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRGSEL_12</name>
                  <description>Trigger-In 12 is selected.</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRGSEL_13</name>
                  <description>Trigger-In 13 is selected.</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRGSEL_14</name>
                  <description>Trigger-In 14 is selected.</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRGSEL_15</name>
                  <description>Software trigger is selected.</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRESCALER</name>
              <description>Prescaler Divider Select</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PRESCALER_0</name>
                  <description>Counting uses the peripheral clock divided by multiplication factor selected by MULT.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRESCALER_1</name>
                  <description>Counting uses the peripheral clock divided by twice of the multiplication factor selected by MULT.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRESCALER_2</name>
                  <description>Counting uses the peripheral clock divided by four times of the multiplication factor selected by MULT.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRESCALER_3</name>
                  <description>Counting uses the peripheral clock divided by eight times of the multiplication factor selected by MULT.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRESCALER_4</name>
                  <description>Counting uses the peripheral clock divided by 16 times of the multiplication factor selected by MULT.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRESCALER_5</name>
                  <description>Counting uses the peripheral clock divided by 32 times of the multiplication factor selected by MULT.</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRESCALER_6</name>
                  <description>Counting uses the peripheral clock divided by 64 times of the multiplication factor selected by MULT.</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRESCALER_7</name>
                  <description>Counting uses the peripheral clock divided by 128 times of the multiplication factor selected by MULT.</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DMAEN</name>
              <description>DMA Enable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DMAEN_0</name>
                  <description>DMA disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMAEN_1</name>
                  <description>DMA enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SWTRIG</name>
              <description>Software Trigger</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>PDBEIE</name>
              <description>PDB Sequence Error Interrupt Enable</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PDBEIE_0</name>
                  <description>PDB sequence error interrupt disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDBEIE_1</name>
                  <description>PDB sequence error interrupt enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LDMOD</name>
              <description>Load Mode Select</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LDMOD_0</name>
                  <description>The internal registers are loaded with the values from their buffers immediately after 1 is written to LDOK.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LDMOD_1</name>
                  <description>The internal registers are loaded with the values from their buffers when the PDB counter reaches the MOD register value after 1 is written to LDOK.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LDMOD_2</name>
                  <description>The internal registers are loaded with the values from their buffers when a trigger input event is detected after 1 is written to LDOK.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LDMOD_3</name>
                  <description>The internal registers are loaded with the values from their buffers when either the PDB counter reaches the MOD register value or a trigger input event is detected, after 1 is written to LDOK.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MOD</name>
          <description>Modulus register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MOD</name>
              <description>PDB Modulus</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CNT</name>
          <description>Counter register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CNT</name>
              <description>PDB Counter</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IDLY</name>
          <description>Interrupt Delay register</description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IDLY</name>
              <description>PDB Interrupt Delay</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
