zephyrproject-rtos/zephyr/ext/hal/nxp/mcux/devices/MKE18F16/MKE18F16.xml
        <register>
          <name>COMBINE</name>
          <description>Function For Linked Channels</description>
          <addressOffset>0x64</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>COMBINE0</name>
              <description>Combine Channels For n = 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COMP0</name>
              <description>Complement Of Channel (n) For n = 0</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>COMP0_0</name>
                  <description>The channel (n+1) output is the same as the channel (n) output.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMP0_1</name>
                  <description>The channel (n+1) output is the complement of the channel (n) output.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DECAPEN0</name>
              <description>Dual Edge Capture Mode Enable For n = 0</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DECAP0</name>
              <description>Dual Edge Capture Mode Captures For n = 0</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DECAP0_0</name>
                  <description>The dual edge captures are inactive.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DECAP0_1</name>
                  <description>The dual edge captures are active.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DTEN0</name>
              <description>Deadtime Enable For n = 0</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DTEN0_0</name>
                  <description>The deadtime insertion in this pair of channels is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DTEN0_1</name>
                  <description>The deadtime insertion in this pair of channels is enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SYNCEN0</name>
              <description>Synchronization Enable For n = 0</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SYNCEN0_0</name>
                  <description>The PWM synchronization in this pair of channels is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYNCEN0_1</name>
                  <description>The PWM synchronization in this pair of channels is enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FAULTEN0</name>
              <description>Fault Control Enable For n = 0</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FAULTEN0_0</name>
                  <description>The fault control in this pair of channels is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FAULTEN0_1</name>
                  <description>The fault control in this pair of channels is enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COMBINE1</name>
              <description>Combine Channels For n = 2</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COMP1</name>
              <description>Complement Of Channel (n) For n = 2</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>COMP1_0</name>
                  <description>The channel (n+1) output is the same as the channel (n) output.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMP1_1</name>
                  <description>The channel (n+1) output is the complement of the channel (n) output.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DECAPEN1</name>
              <description>Dual Edge Capture Mode Enable For n = 2</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DECAP1</name>
              <description>Dual Edge Capture Mode Captures For n = 2</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DECAP1_0</name>
                  <description>The dual edge captures are inactive.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DECAP1_1</name>
                  <description>The dual edge captures are active.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DTEN1</name>
              <description>Deadtime Enable For n = 2</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DTEN1_0</name>
                  <description>The deadtime insertion in this pair of channels is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DTEN1_1</name>
                  <description>The deadtime insertion in this pair of channels is enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SYNCEN1</name>
              <description>Synchronization Enable For n = 2</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SYNCEN1_0</name>
                  <description>The PWM synchronization in this pair of channels is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYNCEN1_1</name>
                  <description>The PWM synchronization in this pair of channels is enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FAULTEN1</name>
              <description>Fault Control Enable For n = 2</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FAULTEN1_0</name>
                  <description>The fault control in this pair of channels is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FAULTEN1_1</name>
                  <description>The fault control in this pair of channels is enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COMBINE2</name>
              <description>Combine Channels For n = 4</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COMP2</name>
              <description>Complement Of Channel (n) For n = 4</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>COMP2_0</name>
                  <description>The channel (n+1) output is the same as the channel (n) output.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMP2_1</name>
                  <description>The channel (n+1) output is the complement of the channel (n) output.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DECAPEN2</name>
              <description>Dual Edge Capture Mode Enable For n = 4</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DECAP2</name>
              <description>Dual Edge Capture Mode Captures For n = 4</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DECAP2_0</name>
                  <description>The dual edge captures are inactive.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DECAP2_1</name>
                  <description>The dual edge captures are active.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DTEN2</name>
              <description>Deadtime Enable For n = 4</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DTEN2_0</name>
                  <description>The deadtime insertion in this pair of channels is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DTEN2_1</name>
                  <description>The deadtime insertion in this pair of channels is enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SYNCEN2</name>
              <description>Synchronization Enable For n = 4</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SYNCEN2_0</name>
                  <description>The PWM synchronization in this pair of channels is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYNCEN2_1</name>
                  <description>The PWM synchronization in this pair of channels is enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FAULTEN2</name>
              <description>Fault Control Enable For n = 4</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FAULTEN2_0</name>
                  <description>The fault control in this pair of channels is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FAULTEN2_1</name>
                  <description>The fault control in this pair of channels is enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COMBINE3</name>
              <description>Combine Channels For n = 6</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COMP3</name>
              <description>Complement Of Channel (n) for n = 6</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>COMP3_0</name>
                  <description>The channel (n+1) output is the same as the channel (n) output.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMP3_1</name>
                  <description>The channel (n+1) output is the complement of the channel (n) output.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DECAPEN3</name>
              <description>Dual Edge Capture Mode Enable For n = 6</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DECAP3</name>
              <description>Dual Edge Capture Mode Captures For n = 6</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DECAP3_0</name>
                  <description>The dual edge captures are inactive.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DECAP3_1</name>
                  <description>The dual edge captures are active.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DTEN3</name>
              <description>Deadtime Enable For n = 6</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DTEN3_0</name>
                  <description>The deadtime insertion in this pair of channels is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DTEN3_1</name>
                  <description>The deadtime insertion in this pair of channels is enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SYNCEN3</name>
              <description>Synchronization Enable For n = 6</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SYNCEN3_0</name>
                  <description>The PWM synchronization in this pair of channels is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYNCEN3_1</name>
                  <description>The PWM synchronization in this pair of channels is enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FAULTEN3</name>
              <description>Fault Control Enable For n = 6</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FAULTEN3_0</name>
                  <description>The fault control in this pair of channels is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FAULTEN3_1</name>
                  <description>The fault control in this pair of channels is enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DEADTIME</name>
          <description>Deadtime Configuration</description>
          <addressOffset>0x68</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DTVAL</name>
              <description>Deadtime Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DTPS</name>
              <description>Deadtime Prescaler Value</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DTPS_0</name>
                  <description>Divide the FTM input clock by 1.</description>
                  <value>#0x</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DTPS_2</name>
                  <description>Divide the FTM input clock by 4.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DTPS_3</name>
                  <description>Divide the FTM input clock by 16.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DTVALEX</name>
              <description>Extended Deadtime Value</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
