zephyrproject-rtos/zephyr/ext/hal/nxp/mcux/devices/MKE18F16/MKE18F16.xml
      </registers>
    </peripheral>
    <peripheral>
      <name>SIM</name>
      <description>System Integration Module</description>
      <groupName>SIM</groupName>
      <prependToName>SIM_</prependToName>
      <baseAddress>0x40048000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x70</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CHIPCTL</name>
          <description>Chip Control register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ADC_INTERLEAVE_EN</name>
              <description>ADC interleave channel enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>No interleave channel</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PTB0</name>
                  <description>PTB0 to ADC0_SE4 and ADC1_SE14</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PTB1</name>
                  <description>PTB1 to ADC0_SE5 and ADC1_SE15</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PTB13</name>
                  <description>PTB13 to ADC1_SE8 and ADC2_SE8</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PTB14</name>
                  <description>PTB14 to ADC1_SE9 and ADC2_SE9</description>
                  <value>0x8</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLKOUTDIV</name>
              <description>CLKOUT divider</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIV1</name>
                  <description>no divider</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV2</name>
                  <description>div 2</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV4</name>
                  <description>div 4</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV8</name>
                  <description>div 8</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLKOUTSEL</name>
              <description>CLKOUT Select</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SCGCLKOUT</name>
                  <description>SCGCLKOUT(SIRC/FIRC/SOSC/LPFLL), see the SCG_CLKOUTCNFG register</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTC32</name>
                  <description>RTC oscillator (OSC32) clock (32 kHz)</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPO</name>
                  <description>LPO clock (128 kHz)</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRACECLK_SEL</name>
              <description>Debug trace clock select</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CORECLK</name>
                  <description>core clock</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PLATFORM</name>
                  <description>platform clock</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PDB_BB_SEL</name>
              <description>PDB back-to-back select</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PDB0</name>
                  <description>PDB0 channel 0 back-to-back operation with ADC0 COCO[7:0]; PDB1 channel 0 back-to-back operation with ADC1 COCO[7:0] ; PDB2 channel 0 back-to-back operation with ADC2 COCO[7:0].</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDBx</name>
                  <description>Channel 0 of PDB0, PDB1 and PDB2 back-to-back operation with COCO[7:0] of ADC0, ADC1 and ADC2.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CAN_FLT_CLK_SEL</name>
              <description>CAN filter clock select</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LPO_CLK</name>
                  <description>LPO clock</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIRC_CLK</name>
                  <description>SIRC clock</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWT_CLKSEL</name>
              <description>PWT clock select</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TCLK0</name>
                  <description>TCLK0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCLK1</name>
                  <description>TCLK1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCLK2</name>
                  <description>TCLK2</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RTC_CLKSEL</name>
              <description>RTC clock select</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OSC32K</name>
                  <description>OSC32_CLK</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTC_CLKIN</name>
                  <description>RTC_CLKIN</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SOSC_CLK</name>
                  <description>SOSC_CLK</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FTMOPT0</name>
          <description>FTM Option Register 0</description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FTM0FLTxSEL</name>
              <description>FTM0 Fault X Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FTM1FLTxSEL</name>
              <description>FTM1 Fault X Select</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FTM2FLTxSEL</name>
              <description>FTM2 Fault X Select</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FTM3FLTxSEL</name>
              <description>FTM3 Fault X Select</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FTM0CLKSEL</name>
              <description>FTM0 External Clock Pin Select</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TCLK0</name>
                  <description>FTM0 external clock driven by TCLK0 pin.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCLK1</name>
                  <description>FTM0 external clock driven by TCLK1 pin.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCLK2</name>
                  <description>FTM0 external clock driven by TCLK2 pin.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>No clock input</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FTM1CLKSEL</name>
              <description>FTM1 External Clock Pin Select</description>
              <bitOffset>26</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TCLK0</name>
                  <description>FTM1 external clock driven by TCLK0 pin.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCLK1</name>
                  <description>FTM1 external clock driven by TCLK1 pin.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCLK2</name>
                  <description>FTM1 external clock driven by TCLK2 pin.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>No clock input</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FTM2CLKSEL</name>
              <description>FTM2 External Clock Pin Select</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TCLK0</name>
                  <description>FTM2 external clock driven by TCLK0 pin.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCLK1</name>
                  <description>FTM2 external clock driven by TCLK1 pin.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCLK2</name>
                  <description>FTM2 external clock driven by TCLK2 pin.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>No clock input</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FTM3CLKSEL</name>
              <description>FTM3 External Clock Pin Select</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TCLK0</name>
                  <description>FTM3 external clock driven by TCLK0 pin.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCLK1</name>
                  <description>FTM3 external clock driven by TCLK1 pin.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCLK2</name>
                  <description>FTM3 external clock driven by TCLK2 pin.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>No clock input</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
