zephyrproject-rtos/zephyr/ext/hal/nxp/mcux/devices/MKE18F16/MKE18F16.xml
        <register>
          <name>PCCRMR</name>
          <description>Cache regions mode register</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xAA0FA000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>R15</name>
              <description>Region 15 mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>R15_0</name>
                  <description>Non-cacheable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>R15_1</name>
                  <description>Non-cacheable</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>R15_2</name>
                  <description>Write-through</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>R15_3</name>
                  <description>Write-back</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>R14</name>
              <description>Region 14 mode</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>R14_0</name>
                  <description>Non-cacheable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>R14_1</name>
                  <description>Non-cacheable</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>R14_2</name>
                  <description>Write-through</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>R14_3</name>
                  <description>Write-back</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>R13</name>
              <description>Region 13 mode</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>R13_0</name>
                  <description>Non-cacheable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>R13_1</name>
                  <description>Non-cacheable</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>R13_2</name>
                  <description>Write-through</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>R13_3</name>
                  <description>Write-back</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>R12</name>
              <description>Region 12 mode</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>R12_0</name>
                  <description>Non-cacheable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>R12_1</name>
                  <description>Non-cacheable</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>R12_2</name>
                  <description>Write-through</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>R12_3</name>
                  <description>Write-back</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>R11</name>
              <description>Region 11 mode</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>R11_0</name>
                  <description>Non-cacheable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>R11_1</name>
                  <description>Non-cacheable</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>R11_2</name>
                  <description>Write-through</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>R11_3</name>
                  <description>Write-back</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>R10</name>
              <description>Region 10 mode</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>R10_0</name>
                  <description>Non-cacheable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>R10_1</name>
                  <description>Non-cacheable</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>R10_2</name>
                  <description>Write-through</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>R10_3</name>
                  <description>Write-back</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>R9</name>
              <description>Region 9 mode</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>R9_0</name>
                  <description>Non-cacheable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>R9_1</name>
                  <description>Non-cacheable</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>R9_2</name>
                  <description>Write-through</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>R9_3</name>
                  <description>Write-back</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>R8</name>
              <description>Region 8 mode</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>R8_0</name>
                  <description>Non-cacheable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>R8_1</name>
                  <description>Non-cacheable</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>R8_2</name>
                  <description>Write-through</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>R8_3</name>
                  <description>Write-back</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>R7</name>
              <description>Region 7 mode</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>R7_0</name>
                  <description>Non-cacheable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>R7_1</name>
                  <description>Non-cacheable</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>R7_2</name>
                  <description>Write-through</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>R7_3</name>
                  <description>Write-back</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>R6</name>
              <description>Region 6 mode</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>R6_0</name>
                  <description>Non-cacheable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>R6_1</name>
                  <description>Non-cacheable</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>R6_2</name>
                  <description>Write-through</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>R6_3</name>
                  <description>Write-back</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>R5</name>
              <description>Region 5 mode</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>R5_0</name>
                  <description>Non-cacheable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>R5_1</name>
                  <description>Non-cacheable</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>R5_2</name>
                  <description>Write-through</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>R5_3</name>
                  <description>Write-back</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>R4</name>
              <description>Region 4 mode</description>
              <bitOffset>22</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>R4_0</name>
                  <description>Non-cacheable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>R4_1</name>
                  <description>Non-cacheable</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>R4_2</name>
                  <description>Write-through</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>R4_3</name>
                  <description>Write-back</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>R3</name>
              <description>Region 3 mode</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>R3_0</name>
                  <description>Non-cacheable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>R3_1</name>
                  <description>Non-cacheable</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>R3_2</name>
                  <description>Write-through</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>R3_3</name>
                  <description>Write-back</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>R2</name>
              <description>Region 2 mode</description>
              <bitOffset>26</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>R2_0</name>
                  <description>Non-cacheable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>R2_1</name>
                  <description>Non-cacheable</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>R2_2</name>
                  <description>Write-through</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>R2_3</name>
                  <description>Write-back</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>R1</name>
              <description>Region 1 mode</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>R1_0</name>
                  <description>Non-cacheable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>R1_1</name>
                  <description>Non-cacheable</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>R1_2</name>
                  <description>Write-through</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>R1_3</name>
                  <description>Write-back</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>R0</name>
              <description>Region 0 mode</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>R0_0</name>
                  <description>Non-cacheable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>R0_1</name>
                  <description>Non-cacheable</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>R0_2</name>
                  <description>Write-through</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>R0_3</name>
                  <description>Write-back</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
  </peripherals>
</device>